redis_test_for_auto_numa_problem/redis_test_result_L_OFF_80G/memtier_benchmark_L_OFF_80G_Random110_P9_20230623173727.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        96365.56          ---          ---        30.20162        27.26300        54.78300        75.26300    205435.57 
Gets         9636.49      9636.49         0.00        29.96530        27.13500        53.50300        74.75100     20496.37 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     106002.05      9636.49         0.00        30.18013        27.26300        54.52700        75.26300    225931.94 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.959        0.000
SET      24.063        5.000
SET      24.703       10.000
SET      25.087       15.000
SET      25.471       20.000
SET      25.727       25.000
SET      25.983       30.000
SET      26.239       35.000
SET      26.495       40.000
SET      26.879       45.000
SET      27.263       50.000
SET      27.519       52.500
SET      27.903       55.000
SET      28.159       57.500
SET      28.543       60.000
SET      29.055       62.500
SET      29.567       65.000
SET      30.207       67.500
SET      31.103       70.000
SET      32.127       72.500
SET      33.535       75.000
SET      34.047       76.250
SET      34.559       77.500
SET      34.815       78.750
SET      35.071       80.000
SET      35.583       81.250
SET      35.839       82.500
SET      36.351       83.750
SET      36.863       85.000
SET      37.375       86.250
SET      38.143       87.500
SET      38.655       88.125
SET      39.167       88.750
SET      39.423       89.375
SET      40.191       90.000
SET      40.703       90.625
SET      41.471       91.250
SET      41.983       91.875
SET      42.751       92.500
SET      43.263       93.125
SET      44.031       93.750
SET      44.543       94.062
SET      45.055       94.375
SET      45.567       94.688
SET      46.079       95.000
SET      46.335       95.312
SET      46.847       95.625
SET      47.359       95.938
SET      47.615       96.250
SET      48.127       96.562
SET      48.639       96.875
SET      48.895       97.031
SET      49.151       97.188
SET      49.407       97.344
SET      49.663       97.500
SET      49.919       97.656
SET      50.175       97.812
SET      50.687       97.969
SET      50.943       98.125
SET      51.455       98.281
SET      51.967       98.438
SET      52.223       98.516
SET      52.735       98.594
SET      52.991       98.672
SET      53.247       98.750
SET      53.759       98.828
SET      54.015       98.906
SET      54.527       98.984
SET      55.295       99.062
SET      55.807       99.141
SET      56.319       99.219
SET      56.831       99.258
SET      57.087       99.297
SET      57.343       99.336
SET      57.599       99.375
SET      58.111       99.414
SET      58.623       99.453
SET      59.135       99.492
SET      59.647       99.531
SET      60.159       99.570
SET      60.927       99.609
SET      61.183       99.629
SET      61.695       99.648
SET      62.207       99.668
SET      62.719       99.688
SET      63.487       99.707
SET      64.255       99.727
SET      64.767       99.746
SET      65.535       99.766
SET      66.559       99.785
SET      67.583       99.805
SET      68.607       99.814
SET      69.119       99.824
SET      69.631       99.834
SET      70.143       99.844
SET      71.167       99.854
SET      72.191       99.863
SET      73.215       99.873
SET      73.727       99.883
SET      74.751       99.893
SET      75.263       99.902
SET      76.287       99.907
SET      77.311       99.912
SET      78.335       99.917
SET      78.847       99.922
SET      80.383       99.927
SET      81.407       99.932
SET      82.431       99.937
SET      83.455       99.941
SET      84.479       99.946
SET      86.527       99.951
SET      87.551       99.954
SET      89.599       99.956
SET      91.135       99.958
SET      94.719       99.961
SET     221.183       99.963
SET     266.239       99.966
SET     282.623       99.968
SET     296.959       99.971
SET     299.007       99.973
SET     311.295       99.976
SET     315.391       99.977
SET     315.391       99.978
SET     317.439       99.979
SET     327.679       99.980
SET     327.679       99.982
SET     327.679       99.983
SET     331.775       99.984
SET     331.775       99.985
SET     342.015       99.987
SET     346.111       99.988
SET     346.111       99.988
SET     346.111       99.989
SET     354.303       99.990
SET     362.495       99.990
SET     368.639       99.991
SET     370.687       99.991
SET     382.975       99.992
SET     395.263       99.993
SET     395.263       99.993
SET     409.599       99.994
SET     428.031       99.994
SET     428.031       99.995
SET     428.031       99.995
SET     440.319       99.995
SET     440.319       99.995
SET     440.319       99.996
SET     454.655       99.996
SET     454.655       99.996
SET     462.847       99.997
SET     565.247       99.997
SET     569.343       99.997
SET     569.343       99.997
SET     569.343       99.997
SET     577.535       99.998
SET     585.727       99.998
SET     585.727       99.998
SET     585.727       99.998
[...]
SET     593.919       99.998
SET     602.111       99.998
SET     602.111       99.999
SET     602.111       99.999
SET     602.111       99.999
[...]
SET     610.303       99.999
SET     614.399       99.999
SET     614.399       99.999
SET     614.399       99.999
[...]
SET     614.399      100.000
SET     614.399      100.000
SET     614.399      100.000
[...]
SET     622.591      100.000
SET     622.591      100.000
---
GET       1.351        0.000
GET      24.063        5.000
GET      24.703       10.000
GET      25.087       15.000
GET      25.343       20.000
GET      25.727       25.000
GET      25.983       30.000
GET      26.239       35.000
GET      26.495       40.000
GET      26.751       45.000
GET      27.135       50.000
GET      27.391       52.500
GET      27.647       55.000
GET      27.903       57.500
GET      28.287       60.000
GET      28.671       62.500
GET      29.055       65.000
GET      29.567       67.500
GET      30.335       70.000
GET      31.231       72.500
GET      32.767       75.000
GET      33.791       76.250
GET      34.303       77.500
GET      34.559       78.750
GET      35.071       80.000
GET      35.327       81.250
GET      35.839       82.500
GET      36.095       83.750
GET      36.607       85.000
GET      37.119       86.250
GET      37.887       87.500
GET      38.143       88.125
GET      38.655       88.750
GET      39.167       89.375
GET      39.679       90.000
GET      40.191       90.625
GET      40.703       91.250
GET      41.471       91.875
GET      41.983       92.500
GET      42.751       93.125
GET      43.519       93.750
GET      44.031       94.062
GET      44.287       94.375
GET      45.055       94.688
GET      45.567       95.000
GET      46.079       95.312
GET      46.335       95.625
GET      46.847       95.938
GET      47.359       96.250
GET      47.871       96.562
GET      48.127       96.875
GET      48.383       97.031
GET      48.639       97.188
GET      48.895       97.344
GET      49.151       97.500
GET      49.407       97.656
GET      49.663       97.812
GET      49.919       97.969
GET      50.431       98.125
GET      50.687       98.281
GET      51.199       98.438
GET      51.455       98.516
GET      51.711       98.594
GET      51.967       98.672
GET      52.223       98.750
GET      52.735       98.828
GET      52.991       98.906
GET      53.503       98.984
GET      53.759       99.062
GET      54.271       99.141
GET      55.039       99.219
GET      55.295       99.258
GET      55.551       99.297
GET      56.063       99.336
GET      56.319       99.375
GET      56.575       99.414
GET      57.087       99.453
GET      57.343       99.492
GET      57.855       99.531
GET      58.367       99.570
GET      59.135       99.609
GET      59.647       99.629
GET      59.903       99.648
GET      60.159       99.668
GET      60.671       99.688
GET      61.183       99.707
GET      61.951       99.727
GET      62.719       99.746
GET      63.999       99.766
GET      64.767       99.785
GET      66.047       99.805
GET      66.559       99.814
GET      67.583       99.824
GET      68.607       99.834
GET      69.119       99.844
GET      70.143       99.854
GET      71.167       99.863
GET      72.703       99.873
GET      73.215       99.883
GET      74.239       99.893
GET      75.263       99.902
GET      75.775       99.907
GET      76.287       99.912
GET      77.823       99.917
GET      78.335       99.922
GET      79.359       99.927
GET      80.895       99.932
GET      82.431       99.937
GET      82.943       99.941
GET      84.479       99.946
GET      85.503       99.951
GET      86.015       99.954
GET      87.551       99.956
GET      90.111       99.958
GET      92.159       99.961
GET     232.447       99.963
GET     280.575       99.966
GET     284.671       99.968
GET     296.959       99.971
GET     299.007       99.973
GET     311.295       99.976
GET     315.391       99.977
GET     315.391       99.978
GET     317.439       99.979
GET     327.679       99.980
GET     327.679       99.982
GET     329.727       99.983
GET     331.775       99.984
GET     342.015       99.985
GET     346.111       99.987
GET     346.111       99.988
GET     346.111       99.988
GET     346.111       99.989
GET     352.255       99.990
GET     362.495       99.990
GET     370.687       99.991
GET     382.975       99.991
GET     395.263       99.992
GET     395.263       99.993
GET     409.599       99.993
GET     411.647       99.994
GET     428.031       99.994
GET     428.031       99.995
GET     428.031       99.995
GET     440.319       99.995
GET     440.319       99.995
GET     454.655       99.996
GET     454.655       99.996
GET     454.655       99.996
GET     565.247       99.997
GET     565.247       99.997
GET     569.343       99.997
GET     569.343       99.997
GET     569.343       99.997
GET     569.343       99.998
GET     585.727       99.998
GET     585.727       99.998
GET     585.727       99.998
[...]
GET     602.111       99.998
GET     602.111       99.998
GET     602.111       99.999
GET     602.111       99.999
GET     602.111       99.999
[...]
GET     614.399       99.999
GET     614.399      100.000
---
WAIT      0.000      100.000